{
    "0": {
      "associatedAstrologicalBody": "Pluto",
      "associatedStarSign": "Scorpio",
      "associatedTarot": "The Fool",
      "majorMessage": "Keep doing what you are doing!",
      "description": "‘Zero’ represents the totality of the Universe—life, death, and rebirth. It is linked to limitlessness and the pure spirit and is often read as signifying everything, anything, and nothing. Since 'zero' energy is closely tied to the spirit, it usually indicates authenticity and spirituality. Often, 'zero' in an Angel Number means that your spirit guides or Higher Power is emphasizing something. For example, in an angel number like ‘50’, the 'zero' magnifies the 'five.' It is saying, “Pay close attention to the 'five' energies in your life!”. However, when presented singly as a direction, core number zeros are usually meant as an encouragement to keep sticking to the path you are on currently. You are going in the right direction!"
    },
    "00": {
      "majorMessage": "You have the freedom to choose your path.",
      "description": "If this number begins to recur in your life, it means that you are in a phase where you are free to make choices about your life. It is a time for great potential and power, so you must remain calm and sensitive to the directions of the Universe. At this time, you should practice faith and embrace adventure moving forward, yet also make sure to analyze your options carefully and wisely. If faced with a challenge too great for you to overcome, this may be reassurance from your angel guides to change direction as necessary. Have faith in yourself and your abilities. Your journey has just begun!",
      "future": "A whole new vista is opening up for you.",
      "actions": "Stay calm. Analyze your options. Step forward in faith."
    },
    "000": {
      "majorMessage": "Angels are here to guide you!",
      "description": "The appearance of ‘000’ in your life brings encouragement with the knowledge that your angel guides or Higher Power is with you, watching over and loving you. They are ready to connect with you and work in your life, bringing you to a greater realization of the part you have to play in this cosmic story. Stay strong and have faith in the talents and gifts that you have been given. The challenges you face will pass. You are one with God, and He loves you.",
      "future": "Challenges you may be facing now, or very soon, will pass.",
      "actions": "Connect with your spiritual guides through meditation and prayer. Affirm through manifestation the Universe’s love for you. Weigh your options carefully."
    },
    "0000": {
      "majorMessage": "The potential for positive change is ripening.",
      "description": "Although potentially a number with connections to bad luck and difficulty, ‘0000’ can be seen as an opportunity to challenge yourself and change for the better. Linked to both the end-times and endlessness, you are faced with the binary reality accompanying all choices. As a result, it is essential to determine the nature of your transformation and path going forward by manifesting positivity. It is a time to attract and initiate a new future, but make sure it is the future you want! Now is the time for you to redirect your Karma by learning from your past, asking for forgiveness, and moving on from toxic habits and relationships.",
      "future": "A choice to pursue a new path with new challenges.",
      "actions": "Assess your intentions and determine where you want to invest your energies. Ask for forgiveness—redirect your Karma. Focus on positivity and change. Move on from toxic relationships."
    },
    "11": {
      "majorMessage": "Get ready for spiritual change.",
      "description": "With the emergence of ‘11’ in your life, this is a sure sign that an opportunity for spiritual enlightenment or awakening has arrived. It’s time for you to learn about yourself, the Universe, and your place in it. Don’t be afraid to seek the truth, even if it means that some of your beliefs or ideas will change. The result will be not only stronger spiritual connections but also positive output into the world. As you start fresh, you will feel the call to lead people to a better life, focusing on harmony and healing, which is sometimes called 'lightwork.' Since ‘11’ is linked to 2 (1+1=2) holds encouragement to pursue harmony and healing.",
      "future": "Opportunities to refresh one’s spiritual life as well as change your creative or work-related outlets.",
      "actions": "Schedule to break bad habits. Minimize social media and other distractions. Start a new hobby or job and embrace creativity."
    },
    "111": {
      "majorMessage": "Monitor your thoughts, as the Universe is listening.",
      "description": "‘111’ promises a new start, where you can leave the past behind you to move forward to a better future. However, you cannot just take hold of these new opportunities. You must also make sure your thoughts and emotions are aligned correctly with your life purpose. The Universe can read your conscious and unconscious negativity, which can affect the outcome of this energy. Maintaining positivity, therefore, is vital, as well as exploring your inner self and properly communicating with your angel guides. At this time, your powers for manifestation are increased. The reason is that ‘111’ has a hidden link to three (1+1+1 =3), which has ties to spiritual awakening and creative power. Don’t overthink it, though! Use the creative energy of ‘111’ to serve others and awaken yourself.",
      "future": "A chance to manifest your desires and dreams.",
      "actions": "Serve others through volunteer work. Use journaling to monitor your thoughts. Reach out to your spirit guides for direction."
    },
    "1111": {
      "majorMessage": "You can achieve it all!",
      "description": "With the lucky number '1111', you need to recognize this as a compelling wake-up call to manifest your dreams. You can achieve this by faith in yourself, positive thinking, and hard work. Linked to four (1+1+1+1 = 4), the energies of ‘1111’ also remind you that you are loved and watched over by your spirit guides. It also means that it is time to work on your personal and spiritual development by reading and studying meaningful scriptures while doing manifestation work. It is necessary to stress how crucial your actions are at this point, as your angels are encouraging you to take action, work hard, pursue intentional thinking, and discover yourself. A fresh perspective and self-confidence will guide you in the next steps of your life path.",
      "future": "Good luck and abundance are up ahead.",
      "actions": "Take note of your dreams and analyze them for important messages. Listen for any words from deceased loved ones. Reprioritize the material world by minimizing your belongings and analyzing what you really need vs. what you want. Speak and write intentional, powerful messages to yourself."
    },
        "22": {
          "majorMessage": "Make your dream of a harmonious, loving world a reality.",
          "description": "The revelation of ‘22’ in your life is a call to work on your soul’s purpose, which in this case, may involve creating a world of harmony, love, and kindness. Of course, this will require work and organization. Since 2+2=4, ‘22’ has strong links to the diligence and practicality of angel number four’s energies. It is not just about feeling good, but also about making practical differences in your own life and others. Sometimes, the appearance of ‘22’ indicates a coming change in the domestic or romantic sphere—new love or a new baby! As you serve others, however, don’t forget to focus on your own needs and potential. This is as much a time about loving yourself as it is about loving others. In the process of personal and spiritual growth, you will find yourself more able to help others who are struggling with finding out their purpose in life. Now is the time to make dreams come true.",
          "future": "Changes in the romantic or familial sphere. New partnerships.",
          "actions": "Take care of yourself and set aside me-time. Listen carefully to the struggles that your family, friends, or coworkers are experiencing. Work with numerology to focus on your current soul purpose."
        },
        "222": {
          "majorMessage": "Trust in yourself and in the goodness of the Universe.",
          "description": "Sometimes, when your life feels chaotic, it is essential to feel a sense of peace. ‘222’ is an encouragement to remember that your intuition and spiritual guidance will not lead you astray. The energy of ‘222’ helps you to control your fears and emotions as you pursue harmony and balance. At this time, unwind and be in the moment, especially as you move forward with projects or work through obstacles that arise. Furthermore, ‘222’ may also bring to your attention old challenges you had failed at prior. With the growth, you have experienced and strong support networks, you will overcome past failures this time around. Linked to Number 6 (2+2+2=6), '222' draws on six's energies, encouraging healthier family connections and work-life balance.",
          "future": "Potential challenges.",
          "actions": "Meditate or practice yoga for increased mindfulness. Rework your schedule to maintain a better balance of work and rest. Speak and write positivity into your life with meaningful, intentional sentences. Get in touch with family or deceased loved ones for support."
        },
        "2222": {
          "majorMessage": "Find peace in absolute faith.",
          "description": "If ‘2222’ shows up in your life, this is a call to balance between home and work life as the path to spiritual growth and success. Without harmony and order, peace and tranquility will not blossom. As a result, you need to trust everything will be OK and focus on taking care of yourself. As you visualize your dreams fully and intentionally, you will be better poised to embrace the abundance coming your way. Since ‘2222’ is linked to eight (2+2+2+2=8), the action-oriented energies of ‘eight’ are vital in this message, suggesting that now is the time to let manifestation take over. Live in the moment and learn to relax as well. When you place absolute faith in your spirit guides or Higher Powers, you will be able to embrace the will of the Universe and grow in love and acceptance. ‘2222’ is your angels’ gentle reminder to be courageous and trust in the plan for your life.",
          "future": "A challenge that allows you to grow in faith and confidence.",
          "actions": "Take time off for a spa trip, staycation, or mini-vacation. Practice yoga to increase mindfulness and relaxation. Visualize, fully, the things and people you want to see in your life."
        },
        "33": {
          "majorMessage": "Your selfless acts of service will elevate your spirit.",
          "description": "The Number 3 traditionally holds a lot of spiritual meaning with connections to the ‘Trinity’ in Christianity and the “Third Eye” in Buddhism. ‘33’ is a strong call on the part of your angel guides to reconnect your physical life with the spiritual. With the emergence of '33', you are encouraged to reach out and help someone else. This may end up being part of your journey to understanding your spiritual purpose. Since ‘33’ often appears during times of crisis, its energies draw you to positive thinking and working towards change. At this time, you should pursue manifestation techniques. Since ‘33’ is linked to six (3+3=6), ‘33’s’ energies connect creativity and self-sacrificing love as a way to serve those around you. During these periods, you are ready for spiritual enlightenment as you utilize imagination and creativity to pursue your dreams, teach yourself lessons, and focus on your priorities. Don’t hold yourself back.",
          "future": "A chance to connect with Ascended Masters while negotiating difficulty in life.",
          "actions": "Serve others through volunteer work. Cut off depressive and negative thinking and speak words of positivity aloud. Read past journal entries to understand how you have grown. Improve communication skills through mindful speech."
        },
        "333": {
          "majorMessage": "You are aligned with your angels.",
          "description": "Receiving '333' as an angel message is a cause for confidence and peace. It means that you are aligned with your angels, and you will reach your goals. You can be confident in your abilities and explore all possibilities open for you. Since ‘333’ is linked to nine (3+3+3=9), this number contains similar vibrations, which promote spiritual growth and completion, as well as opportunities to heal the world around you (known as ‘lightwork’). With the amplified creative energies of three, you will be able to increase manifestation. At this point in time, it is essential to maintain control and communicate clearly with those around you and contact your spirit guides. ‘333’ may also be pointing to an opportunity to learn from an Ascended Master (like the Virgin Mary or Quan Yin) who has come near to you. As you talk with your Ascended Master, your heart must be open for any wisdom they share. Take this moment to recognize your life purpose and utilize your talents correctly. As you are true to yourself and your desires, you will be better positioned to manifest long-term success. It is essential to listen to your truth at this time and not allow yourself to become derailed by negative opinions or advice from other people around you.",
          "future": "Opportunity to study under an Ascended Master.",
          "actions": "Study spiritual materials—prayers, meditations, scriptures, and songs. Meditate and pray. Participate in lightwork through verbal and practical support of grieving for wounded people around you."
        },
        "3333": {
          "majorMessage": "Practice visualization to manifest your dreams.",
          "description": "Holding great amplification of the Number 3, ‘3333’s’ energy enables maximum creative energy and inspiration for work and artistic expression. ‘3333’ encourages and supports you as you visualize so that you can achieve manifestation more quickly. As we form our desires under this number, we will generate passion which promotes positivity and success. More than just material possession, ‘3333’ heralds meaningful, spiritual experiences that will increase your bond with the Universe. Since ‘three’ is tied to the “3-6-9 Principle” and links back to itself (3+3+3+3 = 12 = 1+2 = 3), it is a powerful manifestation number linked to creativity and spiritual expression. When communicating with your angels, this number encourages you to ask for clarification, particularly when options seem overwhelming. At this time, it is excellent to know that your angels and Ascended Masters are there to help you be the best you can be as a person. As you manifest positivity and seek inspiration, you will find opportunities to build social connections and inspire others.",
          "future": "Opportunities for creativity and artistic expression.",
          "actions": "Visualize, fully, the end product of your projects and dreams. Keep your daydreams positive. Network thoughtfully. Be tolerant and compassionate towards friends, family, and coworkers."
        },
            "44": {
              "majorMessage": "You are loved.",
              "description": "When your difficulties feel overwhelming, you may notice '44' appear as a word of encouragement from your angel guides, telling you that you are loved. The energy found in '44' reminds you to keep working throughout the storm because you will fulfill your wishes in time. Trusting your instincts becomes the key to eventual success. You must be patient, diligent, and persevering since circumstances may feel overwhelming and make you doubt your choices. Be reassured, as ‘44’ is positive encouragement to keep fighting. During this period of your life, your angels want you to know that they are still there. They are working as hard as you are on the abundance that is coming.",
              "future": "Abundance and success.",
              "actions": "Stay on track with well-paced scheduling. Pursue positive life choices and habits on a day-to-day basis. Visualize, fully, the things and people you want to see in your life. Don’t focus on your past mistakes; instead, focus on your past achievements."
            },
            "444": {
              "majorMessage": "Time to leverage your gifts and talents.",
              "description": "If ‘444’ is making an appearance in your life, this is a call to spiritual awakening and an opportunity for manifestation. Use the gifts you have been given, as you have received encouragement to keep going and work hard to overcome the obstacles you may be facing. The good news is that you are not alone, for your angels are working alongside you. Don’t lose sight of your soul’s mission because you are so close to the top. Linked to the energies of three (4+4+4= 12 = 1+2 = 3), ‘444’ points to the need for spiritual and personal communication (as well as creativity) as a means to achieving your goals. With the amplification of four’s energies, ‘444’ reminds us to keep working hard and set firm foundations for future success. '444' also tells you that you are on the right path, although you may not feel like it. During these periods, you should pursue spiritual study and renewed awareness. Don’t give up. Your aspirations are almost achieved.",
              "future": "Spiritual awakening or manifestation of your dreams.",
              "actions": "Practice meditation to increase mindfulness and focus. Find ways to block out distractions, such as muting your phone. Connect and communicate with your spirit guides for wisdom and encouragement. Study spiritual materials—prayers, meditations, scriptures, and songs."
            },
            "4444": {
              "majorMessage": "Make your dreams come true.",
              "description": "When ‘4444’ appears as a pattern in your life, see it as a massive cheerleading shout from your angels. Put every effort into your work, and success will come! Of course, you should take your time to accomplish everything well, but you will be unbeatable if you get rid of negativity in your life. With organization and time management, your path will become clear, and results will begin to appear. Therefore, you can see ‘4444’ as signaling a time to celebrate and relax a little. It’s important, after all, to find a balance between work and rest. Linked to seven (4+4+4+4= 16 = 1+6 =7), ‘4444’ holds additional encouragement to pursue self-improvement and development. As you work, you are called to listen to your spirit guides and do what is right for you. Right now, times might feel difficult, but change is right around the corner. With support from your angels, you can know that your hard work, focus, and strength will not go unrewarded. Positivity will manifest the desirable changes you seek, which will help you to support and encourage others.",
              "future": "Manifestation.",
              "actions": "Stay focused and on track with well-paced scheduling and optimized workspaces. Mute social media to minimize distractions and negativity. Find time to relax a little—nature walks or meditation sessions. Celebrate ahead of time!"
            },
            "55": {
              "majorMessage": "Take care of yourself.",
              "description": "If you are seeing the '55' angel number pattern, this is the time to pause and look after yourself. Since five's energies promise change and potential challenges, it is essential to take care of yourself and pursue balance in your life. Not only should you try to eat healthy foods, drink lots of water, and get plenty of sleep, but you should also take this opportunity to undergo spiritual cleansing. Let go of negative past experiences, forgive those who have wronged you, and bury old grudges that are distracting you. Five’s energies represent change, but not all change is good, so you need to take this moment to prepare yourself for whatever challenges or opportunities are coming your way. Without physical and spiritual balance, the transitions of five’s energy may cause you to spiral out of control. Drawing on the power of one (5+5=10 = 1+0 = 1), ‘55’ is telling you, “Don’t be afraid! Put your best foot forward, and your life may never be the same!”",
              "future": "Positive or negative change and challenges.",
              "actions": "Hydrate and eat well. Be sure to get a full eight hours of sleep. Through journaling and other forms of therapy, process grudges."
            },
            "555": {
              "majorMessage": "Great change is coming. Make it happen!",
              "description": "Change is coming! Like all ‘five’ angel numbers, ‘555’ amplifies a message about oncoming transformations through challenge and change, both positive and negative. At this time, it is important to stay positive as you transition. Trust yourself and your angels as you overcome obstacles to personal growth. It is a time of affirmative change, so taking care of your emotional, mental, and spiritual well-being is key. The good news is that this change may happen over time in small increments. Either way, ‘555’ is a warning to prepare so that you can make the best of this extremely energetic time to harness the powers of transformative vibrations. With connection to six’s energies (5+5+5=15 = 1+5=6), ‘555’ also reminds us that the best way to keep balanced and maintain perspective is to connect with the Universe. As you let go of negativity, both past, and present, you can better access the visions that your angels are ready to share with you.",
              "future": "Major change is coming.",
              "actions": "Pursue positive life choices and habits on a day-to-day basis. Meditate or practice yoga for increased mindfulness. Rework your schedule to maintain a better balance of work and rest. Speak and write positivity into your life with meaningful, intentional sentences."
            },
                "66": {
                  "majorMessage": "Heal your soul, and heal others.",
                  "description": "The number ‘66’ may appear in your life when times are challenging or overwhelming. ‘66’, linked to the angel number three (6+6=12 = 1+2 = 3), is a reminder that you are not alone, as your angels are close by and are working on ways to help you achieve manifestation. The presence of ‘three’ also points to a need to embrace creativity and communication to achieve balance in your life. You may need to work on many areas—the balance between work and home life or even the balance between family and personal life. Find time to nurture others, but also remember to take care of yourself as well! Prioritize physical and spiritual health by pursuing fitness or working on past trauma. As balance and stability in relationships and work are restored, you will be better positioned to engage with your motherly energies to nurture others. ‘66’ tells you that love and compassion for yourself are just as important as it is for other people.",
                  "future": "A better day, a better you.",
                  "actions": "Serve others through volunteer work. Pursue positive life choices and habits on a day-to-day basis. Through journaling and other forms of therapy, process grudges and traumas. Rework your schedule to fit in time for self-care and family life."
                },
                "666": {
                  "majorMessage": "Align yourself with Truth and the Universe.",
                  "description": "For Christians, ‘666’ is related to evil, but in numerology, it is linked to the positive energies of nine (6+6+6= 18 = 1+8 = 9), which represents the energies of spiritual completion and healing. Therefore, seeing ‘666’ emerging as a pattern in your life may point to an opportunity to align with transformative spiritual powers. This number may appear during times of challenge to help you stay positive, get back on track, and achieve your dreams, despite the circumstances. Through meditation, introspection, and healing interaction with angel guides and family, you must pursue a balance between the physical and spiritual realm. As you scrap negativity and conflict, you can rest, spend time with family, and heal. ‘666’ may be warning you that you are too focused on the material world, and your spiritual needs are not being met. When this imbalance happens, you give into obsessive thoughts and lose harmony. Therefore, ‘666’ is not so much an omen of bad luck, but as a word of encouragement from your angels to be grateful and patient during discouraging times.",
                  "future": "A chance to spiral or transform.",
                  "actions": "Take time off for a spa trip, staycation, hiking, or mini-vacation. Rework your schedule to fit in time for self-care and family life. Get in touch with the spiritual: meditate, pray, read scriptures, or practice yoga. Mute social media to minimize distractions and negativity."
                },
                "6666": {
                  "majorMessage": "Stop focusing on the material and nourish your soul.",
                  "description": "If ‘6666’ emerges as a pattern in your life, your angels are encouraging you to remain positive, although you may feel like things are spiraling out of control. With positive thinking and the pursuit of balance in your life, you can gain the strength and wisdom to overcome all odds. Linked to the energies of six (6+6+6+6= 24 = 2+4 = 6), ‘6666’ is a friendly warning to stay on track, be honest about your feelings, elevate your spirit, and take care of your body. Since the Universe reads your vibrations, it is crucial to keep your vibrations positive and focused on manifestation. During this time, therefore, you may need to care for yourself even more by muting social media, encouraging intentional positivity, and taking time to develop spiritually. Your angels may also be using '6666' to warn about toxic, addictive, or obsessive behavior that erodes your mental and spiritual well-being. The good news is that you are not alone. Be sure to ground yourself with positive friendships and relationships, healing rifts, and nurturing others around you.",
                  "future": "You will overcome obstacles.",
                  "actions": "Meditate or practice yoga for increased mindfulness. Rework your schedule to maintain a better balance of work and rest. Speak and write positivity into your life with meaningful, intentional sentences. Serve others through volunteer work. Analyze physical and mental habits, looking for toxic or obsessive behavior."
                },
                "77": {
                  "majorMessage": "Be confident! You have been blessed.",
                  "description": "Your angels are cheering you onward! '77' emerging in your life should be seen as encouragement from your angel guides. It is a call to be confident and prepared for the next new phase of growth. You did well, but your angels are also giving you a heads-up— change is coming. This is because ‘77’ is linked to five’s energies (7+7 = 14 = 1+4 = 5). As a result, this is a time for celebration and preparation. Set your intentions at this time by writing or speaking with the aid of precise visualization to enhance your manifestation techniques. It is also a good idea to study spiritual practices and increase your knowledge of the Universe. As you develop your spiritual self, you will cultivate positive relationships with your angel guides and other areas of life, such as romance. ‘77’ tells you to feel confident that you are on the right path, but don’t forget to keep moving forward. Take advantage of this number right now to achieve manifestation because this number’s power can fade with inaction.",
                  "future": "Manifestation of your goals and dreams.",
                  "actions": "Practice meditation to increase mindfulness and focus. Study spiritual materials—prayers, meditations, scriptures, and songs. Use the manifestation techniques in Chapter 7 to maximize manifestation potential. Connect and communicate with your spirit guides and Ascended Masters."
                },
                "777": {
                  "majorMessage": "You are in sync with the Universe!",
                  "description": "‘777’ is a shout-out, reassuring you that you are properly aligned with the Universe and your internal truths. During this time, your heart is open to higher consciousness, spiritual enlightenment, and manifestation. Now is the time to recover balance and perspective, especially in assessing material possessions, needs, and desires. ‘777’ signals a time when we are better able to evaluate our lives properly. With this new perspective comes new possibilities, particularly in the spiritual realm. Since ‘777’ is linked to three (7+7+7=21 = 2+1 = 3), energies of creativity and communication point to a shift that is required on your part. Pay attention to the communication of angel guides through scriptures, synchronicities, and meditation sessions. As this spiritual evolution begins to take effect, you will start to fully understand the support of your angels and the reality of manifestation. As spiritual possibility becomes a reality, abandon negativity and get ready to access your spiritual intuition for the next phase of your life.",
                  "future": "Chances to achieve further spiritual enlightenment.",
                  "actions": "Get in touch with the spiritual: meditate, pray, read scriptures, and practice yoga. Research spiritual practices and beliefs that will enhance your growth. Journal. Visualize, fully, the things and people you want to see in your life."
                },
                    "88": {
                      "majorMessage": "Open yourself to abundance.",
                      "description": "The emergence of ‘88’ in your life as a synchronicity promises you that material blessings are on the way. However, our spirits and minds must be open to abundance through attitudes and practices encouraging receiving and giving. With responsibility and diligence, you will weather the difficult times and not only survive but thrive! '88' encourages you to remember that success and fulfillment are just around the corner. You only need to focus and persevere. As a result, you need to plan well, treat money with respect, practice gratitude, and make wise choices. Know that your angel guides are working to support your path to success. Just make sure that you are not swept away by greed or obsession with material gain on this journey. Linked to the energies of Number 7 (8+8=16 = 1+6= 7), ‘88’ also reminds us that spirituality is directly related to the physical world. Our spiritual attitudes toward wealth and finances will affect our success. As a result, virtues such as discernment, abstinence, generosity, gratitude, and moderation will be rewarded. It would help if you worked on a positive relationship and attitude towards money. As a result, your financial aspirations will be achieved through manifestation.",
                      "future": "Material blessing is on the way.",
                      "actions": "Manage debt and stay on top of bills. Spend wisely and budget. Stay focused and on track with well-paced scheduling and optimized workspaces. Speak and write specific financial aspirations into your life with meaningful, intentional sentences."
                    },
                    "888": {
                      "majorMessage": "It’s time to face your Karma!",
                      "description": "You are at the cusp of a new phase in your life. At this time, you are poised to receive rewards for all of your hard work. However, it is crucial to let go of negative thoughts and feelings to embrace the change that is brewing. This mental and spiritual readiness increases your rate of manifestation. Part of this process involves an attitude shift. '888' is encouraging you to act as if you already have the wealth you want. The Universe will notice your positive vibrations and bring the happiness you seek. Linked to the energies of six (8+8+8=24 = 2+4= 6), ‘888’ encourages you to embrace balance and stability, particularly in terms of material wealth. With healthy boundaries set around your attitude towards wealth, you are ready to receive material and spiritual abundance. Since ‘888’ is a Karmic Number, your spiritual well-being plays an integral part in the outcome of your rewards. At this time, you should improve your Karma by blessing others and developing yourself spiritually. Since this is the start of a new phase filled with its challenges, make sure to take the time to celebrate and enjoy the fruits of your labor. During this period, you should tap into new talents and skills to start new projects or tackle a new job or relationship. A world of opportunity is ready to be discovered!",
                      "future": "Karma returns, either good or bad.",
                      "actions": "Speak and write finance-related positivity into your life with meaningful, intentional sentences. Start a new project, hobby, or skill. Use meditation, prayer, and journaling to navigate and work through your Karma. Celebrate the rewards you are experiencing now."
                    },
                    "8888": {
                      "majorMessage": "You are getting what you are owed.",
                      "description": "Angels have got your back! The presence of ‘8888’ in your life should reassure you that a large amount of good fortune is coming! You are finally reaping the rewards of all that hard work you have been doing. There will be a positive change in your luck, but you need to be diligent, focused, and persevering to make the most of these positive vibrations. Now is not the time to dwell on past pains or grievances. Instead, embrace positive thinking and the abundance that is starting to arrive. Reach out to coworkers, friends, and family to share in your good fortune. Now is the time to network and prepare for the next phase. Another essential aspect to consider is renewal. With the vibrations of '8888', use this opportunity to renew spiritual vows and rediscover your spiritual gifts. Linked to the energies of five (8+8+8+8= 32 = 3+2= 5), ‘8888’ holds a promise of positive change, particularly in terms of finances. It's time to leverage personal freedom and material accumulation energies to achieve financial stability and prepare for the next set of challenges ahead. Stay strong with the knowledge that the Universe has your back. Don’t be afraid! Push your limits!",
                      "future": "Good fortune and financial windfall are around the corner.",
                      "actions": "Through journaling and other forms of therapy, process grudges and traumas. Pursue positive life choices and habits on a day-to-day basis. Visualize, fully, the end product of your projects and dreams. Network thoughtfully."
                    },
                    "99": {
                      "majorMessage": "Don't delay! The time for your life mission has come.",
                      "description": "If you notice ‘99’ showing up as a pattern in your life, see this as a wake-up call from your angels. It is an alarm bell letting you know that your chance to fulfill your soul's mission has come. The energies of ‘99’ are deeply action-oriented, pushing you to follow the plan the Universe has for you courageously. You should not delay. Change is coming, but don't be afraid! You are a lightworker, someone who has received the vital job of serving humanity and making the world a better place. '99' appears during serious decision-making times. When it appears, it is time to take action and pursue ways to do good. As you pursue proactive energies, you take ownership of and become empowered through your life’s mission. Since ‘99’ has extra hidden nine powers (9+9=18 = 1+8= 9), it is a number of completion and ascension, challenging you to trust your spiritual intuition and higher powers for guidance. As you release attitudes and things you don’t need, you will be better able to practice self-love, develop self-control, and fully commit to your life purpose.",
                      "future": "Serious decision-making time.",
                      "actions": "Get in touch with the spiritual: meditate, pray, read scriptures, and practice yoga. Serve others through volunteer work or charitable giving. Minimize your belongings. Speak and write spiritual positivity into your life with meaningful, intentional sentences."
                    },
                    "999": {
                      "majorMessage": "Learn from the past to move fearlessly into your future.",
                      "description": "‘999’ announces the end of a cycle and the beginning of another. Don’t worry! The Universe is planning and preparing something great for you. Now is the time to appreciate all of the hard work and rewards you have gained through your past experiences. As another door opens, you can take this time to look back and analyze the bigger picture of your life. Tap into your inner power and embrace the spiritual maturity that is happening. As your soul-mission comes into view, this may be your call to lightwork, which involves healing the Earth and helping others. Like ‘99’, ‘999’ has hidden ‘nine’ energies (9+9+9=27 = 2+7= 9) which amplifies the message of spiritual completion and ascension. However, sometimes we allow our past experiences to define us and our future solely. ‘999’ reminds us that we are more than our failures or traumas. It challenges us to jettison our fears and pains and embrace our spiritual future. In turn, our pursuit for authenticity and elevation will inspire and support others.",
                      "future": "Another phase of your life is starting.",
                      "actions": "Pursue visions of your next step through numerological calculations, as well as other spiritual practices and rituals. Fully visualize new projects and dreams. Through journaling and other forms of therapy, let the past go. Review your meditations, journal entries, and life choices to analyze the big picture of your life."
                    },
                    "9999": {
                      "majorMessage": "Time to understand your life purpose.",
                      "description": "It’s time to tap into divine wisdom. The emergence of ‘9999’ in your life is trying to help you channel your energies toward positive interactions with the world through lightwork or positive leadership. ‘9999’ lets you know that you are meant to help people and heal the world. You are unique, a beacon of hope working out good Karma and positive synchronicity. Don’t be afraid. Blessings are coming. We just need to prepare for them by protecting our energy from negativity and surrounding ourselves with beauty and light. If you are currently facing depressing or negative input from others or life circumstances, work practically toward solving these issues to utilize the vibrations of '9999' properly. Like '99' and '999', '9999' holds the ultimate hidden Number 9 (9+9+9+(= 36 = 3+6= 9), pointing to spiritual completion and purpose. Self-sacrificing, compassionate, patient, and optimistic, you work for the welfare of humanity, seemingly at the cost of your existence. However, because of your deep connections to the spiritual heart of the Universe, you will never run dry. Your angels are working closely with you as you end one phase and begin another. Your cup is overflowing.",
                      "future": "Opportunity to heal the world.",
                      "actions": "Serve others through volunteer work or charitable giving. Speak positivity into other people’s lives through works of art, words of encouragement, gifts of generosity, and charitable work. Stay focused and on track with well-paced scheduling and optimized workspaces. Meditate or practice yoga for increased mindfulness and spiritual sensitivity."
                    },
                    "723": {
                      "majorMessage" : "Encourages you to find a balance between your work life, leisure and rest times",
                      "description" : "Number 723 is a blend of the attributes of number 7, the energies of number 2, and the vibrations of number 3. Number 7 relates to the esoteric and mystical, spiritual awakening and development, emotions and feelings, persistence of purpose and determination, discernment and positive intentions, inner-knowing and understanding others, empathic and psychic abilities, and education and learning. Number 2 encourages finding balance and harmony, faith and trust, understanding, service to others, diplomacy and mediation, selflessness, love and happiness. Number 2 also relates to serving your soul mission and life purpose. Number 3 relates to self-expression and communication, optimism and enthusiasm, natural skills and talents, friendliness and sociability, growth, expansion and the principles of increase. Number 3 also resonates with the vibrations of the Ascended Masters.",
                      "future" : "Angel Number 723 is a message that your mind-set, intentions and efforts in regards to your soul mission will reap many long-term benefits and rewards in your life. Trust that you are on the right path and your angels encourage and support you every step of the way.  Keep up the good work and continue to manifest your good.",
                      "actions" : " Relaxing and taking the time to meditate and connect and communicate with the angels will assist with manifesting desired results and outcomes in your life. Stay focused on your life purpose and trust that the angels and Ascended Masters surround, encourage and support you. Stay open to angelic guidance."
                    }
                  }
                  
              