{
    "lifePath": {
      "1": "Independence and becoming a leader",
      "2": "Partnership and balance",
      "3": "Creativity and self-expression",
      "4": "Stability and process",
      "5": "Freedom and adventure",
      "6": "Responsibility and service",
      "7": "Thought and analysis",
      "8": "Power and ambition",
      "9": "Humanitarianism and compassion",
      "11": "Spiritual messenger and inspirational insight",
      "22": "Master builder and realization of dreams",
      "33": "Compassion and blessing"
    },
    "personality": {
      "1": "Ambitious and Assertive - Individuals with a Personality number of 1 are often perceived as confident, ambitious, and assertive. They exude leadership qualities and are often seen as natural-born leaders. They have a strong presence and are not afraid to take charge in various situations. Others may perceive them as determined and focused individuals who know what they want and are willing to work hard to achieve it.",
      "2": "Diplomatic and Cooperative - People with a Personality number of 2 are perceived as diplomatic, cooperative, and harmonious. They have a gentle demeanor and are skilled at navigating social interactions with grace and tact. They are good listeners and are often seen as supportive and empathetic individuals who value collaboration and teamwork. Others may perceive them as peacemakers who strive to create harmony in their relationships and surroundings.",
      "3": "Charismatic and Expressive - A Personality number of 3 suggests a person who is perceived as charismatic, expressive, and creative. They have a magnetic personality and are often the life of the party. They have a way with words and are skilled at communicating their thoughts and ideas in engaging ways. Others may perceive them as fun-loving, enthusiastic individuals who bring joy and excitement wherever they go.",
      "4": "Practical and Dependable - Individuals with a Personality number of 4 are perceived as practical, dependable, and reliable. They have a strong work ethic and are known for their attention to detail and organizational skills. They are often seen as grounded and responsible individuals who can be counted on to follow through on their commitments. Others may perceive them as trustworthy and steady presences in their lives.",
      "5": "Adventurous and Dynamic - People with a Personality number of 5 are perceived as adventurous, dynamic, and versatile. They have a restless spirit and are always seeking new experiences and challenges. They thrive in environments that offer variety and excitement. Others may perceive them as energetic and spontaneous individuals who bring a sense of adventure to everything they do.",
      "6": "Nurturing and Compassionate - A Personality number of 6 suggests a person who is perceived as nurturing, compassionate, and caring. They have a nurturing nature and are often seen as the caregivers in their social circles. They are deeply empathetic and have a strong sense of responsibility towards their loved ones. Others may perceive them as warm-hearted and supportive individuals who are always there to lend a helping hand.",
      "7": " Introspective and Analytical - Individuals with a Personality number of 7 are perceived as introspective, analytical, and wise. They have a thoughtful demeanor and are often seen as deep thinkers who enjoy pondering life's mysteries. They have a keen intellect and are skilled at analyzing complex problems. Others may perceive them as insightful and wise individuals who offer valuable perspectives and guidance.",
      "8": "Confident and Authoritative - People with a Personality number of 8 are perceived as confident, authoritative, and ambitious. They have a commanding presence and are often seen as natural leaders. They exude confidence and are not afraid to assert themselves in various situations. Others may perceive them as powerful and influential individuals who are capable of achieving great success.",
      "9": "Compassionate and Idealistic - A Personality number of 9 suggests a person who is perceived as compassionate, idealistic, and humanitarian-minded. They have a strong sense of empathy and are deeply committed to making a positive difference in the world. They are often seen as altruistic individuals who are dedicated to serving others. Others may perceive them as compassionate and inspirational figures who inspire others to do good."
    },
    "soulUrge": {
      "1": "Your soul urge is a driving force! You trust your instincts above all else. You are convinced that your actions have great meaning in the world, and you are correct. You have a deep need to be heard and will only feel fulfilled in leadership roles, where your natural abilities and pioneering spirit will thrive.\nWith the kind of self-assurance you possess, you might have run-ins with authority figures throughout your life. You tend towards dominance and should be careful not to silence others - you're the type of person who doesn't even notice when you've hurt someone's feelings. When it comes down to it, though, you are incredibly loyal, and you'll receive loyalty in return.",
      "2": "Your heart's desire is to be not just loved but needed. You have a deep desire to connect with others on a personal level and strive toward balance and cooperation in all your relationships. You're a natural team player and will only thrive when you are part of something larger than yourself.\nYou're skilled at cooperation and keeping the peace - which is great for you because interpersonal conflict is not something you handle well. Your need to be loved leads to a sensitivity that can make uncomfortable situations deeply troubling for you. You're also prone to distrusting yourself because you so highly value the consensus of others. The truth is, your strength in interpersonal relationships comes from your strong intuition, so you must learn to trust your gut.",
      "3": "People with this Soul Urge are often drawn to artistic pursuits, communication, and social interactions. They are typically lively, imaginative, and enjoy expressing themselves through various forms of creativity, such as writing, music, art, or performance. They often have a natural charm and charisma that draws others to them, and they thrive in social settings where they can share their ideas and connect with others. Overall, a Soul Urge number of 3 suggests a person who finds fulfillment and purpose through creative expression and positive social interactions",
      "4": "Stability and Practicality - People with a Soul Urge number of 4 are often focused on building a solid foundation in their lives. They value stability, security, and practicality. They are hardworking, reliable, and methodical individuals who seek to create order and structure in their personal and professional endeavors.",
      "5": "Freedom and Adventure - A Soul Urge number of 5 suggests a person who craves excitement, adventure, and freedom. These individuals are drawn to new experiences, travel, and exploration. They thrive on variety and change, and they may resist anything that feels too restrictive or confining. They are adaptable, curious, and open-minded, always eager to embrace the next adventure that life has to offer.",
      "6": "Nurturing and Harmony - People with a Soul Urge number of 6 are often deeply compassionate and nurturing individuals. They have a strong desire to create harmony and balance in their relationships and surroundings. They are devoted to their loved ones and may take on caretaking roles within their families or communities. They value beauty, peace, and cooperation, and they strive to create environments where everyone feels supported and cared for.",
      "7": "Introspection and Wisdom - A Soul Urge number of 7 suggests a person who is introspective, analytical, and wise. These individuals are drawn to seeking knowledge and understanding through introspection, reflection, and study. They may have a deep interest in spirituality, philosophy, or metaphysics. They value solitude and contemplation, and they often find fulfillment in exploring the deeper mysteries of life and the universe.",
      "8": "Ambition and Achievement - People with a Soul Urge number of 8 are often driven by a strong sense of ambition and a desire for achievement. They are focused on success, power, and material abundance. They are often natural leaders who are skilled at strategic planning and goal-setting. They have a strong work ethic and are willing to put in the effort necessary to achieve their goals and aspirations.",
      "9": "Compassion and Humanitarianism - A Soul Urge number of 9 suggests a person who is deeply compassionate and humanitarian-minded. These individuals are drawn to serving others and making a positive difference in the world. They are empathetic, altruistic, and idealistic, often dedicating themselves to causes that promote social justice, equality, and humanitarian efforts. They may have a strong sense of empathy and a desire to alleviate suffering wherever they see it."
    },
    "hiddenPassion": {
      "1": "Independence and Leadership - Individuals with a Hidden Passion number of 1 are driven by a desire for independence, achievement, and leadership. They possess strong willpower and determination, and they are often focused on establishing themselves as self-reliant and capable individuals. They thrive when given the opportunity to take initiative and lead others, and they are often drawn to careers that allow them to assert their independence and pursue their ambitions.",
      "2": "Harmony and Cooperation - People with a Hidden Passion number of 2 are motivated by a desire for harmony, cooperation, and partnership. They excel in situations that require diplomacy, empathy, and teamwork. They are skilled at navigating interpersonal relationships and strive to create peace and balance in their interactions with others. They may be drawn to careers in counseling, mediation, or other fields that involve working closely with people to achieve common goals.",
      "3": " Expression and Creativity - A Hidden Passion number of 3 suggests a person who is driven by a desire for self-expression, creativity, and social interaction. These individuals are often naturally talented communicators, with a gift for articulating their thoughts and ideas in engaging ways. They may excel in artistic pursuits such as writing, music, or visual arts, and they thrive in social settings where they can share their creativity with others.",
      "4": " Stability and Organization - Individuals with a Hidden Passion number of 4 are motivated by a desire for stability, security, and organization. They excel in roles that require attention to detail, methodical planning, and practical problem-solving. They are reliable and hardworking individuals who take pride in their ability to create order and structure in their lives and environments. They may be drawn to careers in fields such as finance, engineering, or project management.",
      "5": "Freedom and Adventure - People with a Hidden Passion number of 5 are driven by a desire for freedom, adventure, and excitement. They thrive on change and variety, and they may feel restless in situations that feel too routine or predictable. They are adventurous spirits who are always seeking new experiences and challenges. They may be drawn to careers that involve travel, exploration, or entrepreneurship.",
      "6": "Responsibility and Service - A Hidden Passion number of 6 suggests a person who is motivated by a desire for responsibility, service, and nurturing others. These individuals are often deeply compassionate and caring, with a strong sense of duty towards their loved ones and communities. They thrive when they are able to provide support and guidance to others, and they may be drawn to careers in caregiving, teaching, or social work.",
      "7": "Knowledge and Wisdom - Individuals with a Hidden Passion number of 7 are driven by a desire for knowledge, wisdom, and spiritual understanding. They are naturally curious and introspective, with a deep interest in uncovering the mysteries of life and the universe. They excel in roles that require critical thinking, analysis, and research. They may be drawn to careers in academia, science, or spirituality.",
      "8": "Ambition and Achievement - People with a Hidden Passion number of 8 are motivated by a desire for success, achievement, and material abundance. They are ambitious and determined individuals who are willing to work hard to achieve their goals. They possess strong leadership skills and are often drawn to roles that allow them to assert their authority and influence. They may be drawn to careers in business, finance, or entrepreneurship.",
      "9": "Compassion and Humanitarianism - A Hidden Passion number of 9 suggests a person who is driven by a desire for compassion, humanitarianism, and making a positive difference in the world. These individuals are deeply empathetic and altruistic, with a strong sense of social justice and equality. They are drawn to roles that allow them to serve others and contribute to the greater good. They may be drawn to careers in fields such as philanthropy, activism, or community organizing."
    }
  }
  